app/views/users/_form.html.erb

SELECT "user_makeups".* FROM "user_makeups" WHERE "user_makeups"."user_id" = $1  [["user_id", 13]]
---
          <div class="form-group">
          <%= m.collection_select :makeup_id, Makeup.all, :id, :makeup_name, placeholder: "makeup" %>