app/views/users/new.html.erb

SELECT "makeups".* FROM "makeups"
---
            <div class="form-group">
            <%= m.collection_select :makeup_id, Makeup.all, :id, :makeup_name, placeholder: "What makeup do you use?" %>