app/views/users/show.html.erb


<%= @user.makeups.first.brand %> <br/>
<%= @user.makeups.first.product %><br/>
<%= @user.makeups.first.shade %><br/>
---
SELECT  "makeups".* FROM "makeups" INNER JOIN "user_makeups" ON "makeups"."id" = "user_makeups"."makeup_id" WHERE "user_makeups"."user_id" = $1  ORDER BY "makeups"."id" ASC LIMIT 1
SELECT  "true_shades".* FROM "true_shades"  WHERE "true_shades"."id" = $1 LIMIT 1