app/views/makeups/index.html.erb

    <div class="makeup-matches">
      <h2><%= current_user.name %>'s <%= @current_user.makeups.first.true_shade.name %> Shade Matches:</h2>
---
SELECT "makeups".* FROM "makeups" WHERE "makeups"."true_shade_id" = 14