app/views/makeups/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."makeup_id" = $1  [["makeup_id", 12]]
---
        <div class="large-12 columns">
          <% @makeup.reviews.each do |review| %>