app/controllers/makeups_controller.rb

  def index
    @makeups = Makeup.all
---
SELECT "makeups".* FROM "makeups"

  def create
    @makeup = Makeup.new(makeup_params)
    # @makeup = current_user.makeups.create(user_id: @user.id, makeup_id: @makeup.id)

    respond_to do |format|
      if @makeup.save
---
INSERT INTO "makeups" ("brand", "created_at", "product", "shade", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["brand", "Revlon"], ["created_at", Fri, 19 Sep 2014 02:55:11 UTC +00:00], ["product", "ColorStay"], ["shade", "Golden Beige"], ["updated_at", Fri, 19 Sep 2014 02:55:11 UTC +00:00]]

  def show
    @makeup = Makeup.find(params[:id])
---
SELECT  "makeups".* FROM "makeups"  WHERE "makeups"."id" = $1 LIMIT 1

  def destroy
    @makeup = Makeup.find(params[:id])
    @makeup.destroy
---
SELECT "makeups".* FROM "makeups" WHERE "makeups"."id" = $1 LIMIT 1  [["id", "7"]]
DELETE FROM "makeups" WHERE "makeups"."id" = $1  [["id", 7]]