app/controllers/makeups_controller.rb

SELECT "makeups".* FROM "makeups" WHERE "makeups"."true_shade_id" = 14
---
  def index
    @makeups = Makeup.where(true_shade_id: current_user.true_shade_id)