app/controllers/reviews_controller.rb

  def create
    puts "XXXXXXXXXXX"
    puts params
    @makeup = Makeup.find(params[:makeup_id])
    @review = current_user.reviews.new(review_params)
    @review.makeup_id = @makeup.id
    if @review.save
---
SELECT "makeups".* FROM "makeups" WHERE "makeups"."id" = $1 LIMIT 1  [["id", "12"]]
INSERT INTO "reviews" ("comment", "created_at", "makeup_id", "rating", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "asdf"], ["created_at", Wed, 24 Sep 2014 01:48:58 UTC +00:00], ["makeup_id", 12], ["rating", 3], ["updated_at", Wed, 24 Sep 2014 01:48:58 UTC +00:00], ["user_id", 9]]