app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'carol@gmail.com' ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    user = User.where(email: params[:user][:email]).first