app/controllers/users_controller.rb

SELECT "user_makeups".* FROM "user_makeups" WHERE "user_makeups"."user_id" = $1 AND "user_makeups"."owns" = 't' ORDER BY "user_makeups"."id" ASC LIMIT 1  [["user_id", 13]]
---
  def show
    @user = User.find(params[:id])
    @user_makeup = @user.user_makeups.where(owns: true)