app/controllers/user_makeups_controller.rb

INSERT INTO "user_makeups" ("created_at", "makeup_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 24 Sep 2014 03:01:51 UTC +00:00], ["makeup_id", 3], ["updated_at", Wed, 24 Sep 2014 03:01:51 UTC +00:00], ["user_id", 4]]
---
  def create
    @user_makeup = UserMakeup.create(user_id: cu  rrent_user.id, makeup_id: params[:makeup_id])