app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    puts 'LOOK'
    puts params[:user]

      if @user.save
        UserMakeup.create(makeup_id: params[:user][:user_makeups_attributes][:'0'][:makeup_id], user_id: @user.id)
        @my_makeup = @user.makeups.first
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "user_makeups" ("created_at", "makeup_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT  "makeups".* FROM "makeups" INNER JOIN "user_makeups" ON "makeups"."id" = "user_makeups"."makeup_id" WHERE "user_makeups"."user_id" = $1  ORDER BY "makeups"."id" ASC LIMIT 1